# FilterStringRule Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
FilterStringRule Members
FilterStringRule Class Constructors Methods Properties See Also
---
The FilterStringRule type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FilterStringRule(FilterableValueProvider, FilterStringRuleEvaluator, String) | Constructs an instance of FilterStringRule. |
| FilterStringRule(FilterableValueProvider, FilterStringRuleEvaluator, String, Boolean) | **Obsolete.** Constructs an instance of FilterStringRule. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from FilterRule.) |
| ElementPasses | Derived classes override this method to implement the test that determines whether the given element passes this rule or not.  (Inherited from FilterRule.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetEvaluator | Gets the evaluator that implements the test for this rule. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetRuleParameter | Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter.  (Inherited from FilterRule.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetEvaluator | Sets the evaluator that implements the test for this rule. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterRule.) |
| RuleString | The user-supplied string against which strings from a Revit document will be tested. |

# See Also
FilterStringRule Class
Autodesk.Revit.DB Namespace